.src/0-163-notes/Base/e-http.org
#+TITLE: HTTP 协议


* HTTP

超文本传输协定（英语： HyperText Transfer Protocol，缩写：HTTP）是一种用于分布式、协作式和超媒体信息系统的应用层协议。HTTP 是全球资讯网的数据通信的基础。

- 基于 *请求* - *响应* 的机制
- 无状态的（不会记录到底是谁发来的请求）

优势:
- 因为简单，所以完善，所以可靠
- 所以没有冗余，所以更快
- 因为规则简单，所以易于理解，易于实现
- 因为简单，所以可以将功能做到极致(连接效率)
- 领域广，分布式

参考:
- https://www.cnblogs.com/ranyonsue/p/5984001.html

* Status Code (状态码)

200: 请求成功，正常返回。

404: 服务器没有找到你请求的页面。

405: 页面是存在，但是请求的方法不对 (get/post)

500: 服务器找到了页面，但是在处理的时候，它出异常了！
