html/163/Base/e-http.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>HTTP 协议</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">HTTP 协议</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05d25d0">1. HTTP</a></li>
<li><a href="#org3c01a5b">2. Status Code (状态码)</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org05d25d0" class="outline-2">
<h2 id="org05d25d0"><span class="section-number-2">1</span> HTTP</h2>
<div class="outline-text-2" id="text-1">
<p>
超文本传输协定（英语： HyperText Transfer Protocol，缩写：HTTP）是一种用于分布式、协作式和超媒体信息系统的应用层协议。HTTP 是全球资讯网的数据通信的基础。
</p>

<ul class="org-ul">
<li>基于 <b>请求</b> - <b>响应</b> 的机制</li>
<li>无状态的（不会记录到底是谁发来的请求）</li>
</ul>

<p>
优势:
</p>
<ul class="org-ul">
<li>因为简单，所以完善，所以可靠</li>
<li>所以没有冗余，所以更快</li>
<li>因为规则简单，所以易于理解，易于实现</li>
<li>因为简单，所以可以将功能做到极致(连接效率)</li>
<li>领域广，分布式</li>
</ul>

<p>
参考:
</p>
<ul class="org-ul">
<li><a href="https://www.cnblogs.com/ranyonsue/p/5984001.html">https://www.cnblogs.com/ranyonsue/p/5984001.html</a></li>
</ul>
</div>
</section>

<section id="outline-container-org3c01a5b" class="outline-2">
<h2 id="org3c01a5b"><span class="section-number-2">2</span> Status Code (状态码)</h2>
<div class="outline-text-2" id="text-2">
<p>
200: 请求成功，正常返回。
</p>

<p>
404: 服务器没有找到你请求的页面。
</p>

<p>
405: 页面是存在，但是请求的方法不对 (get/post)
</p>

<p>
500: 服务器找到了页面，但是在处理的时候，它出异常了！
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-03-09</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
